# Shell tools
brew "bat"
brew "ghostty"
brew "docker-completion"
brew "font-jetbrains-mono-nerd-font"
brew "fzf"
brew "lsd"
brew "starship"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
brew "zoxide"

# Languages
brew "go"
brew "php"
brew "python"

# Runtimes
brew "deno"
brew "node"

# Dev tools
brew "adr-tools"
brew "aws-cdk"
brew "clang-format"
brew "codex"
brew "composer"
brew "evans"
brew "gh"
brew "git"
brew "git-delta"
brew "golangci-lint"
brew "nao1215/tap/gup"
brew "httpie"
brew "jq"
brew "mas"
brew "ngrok"
brew "pnpm"
brew "wget"

# Infra tools
brew "awscli"
brew "cosign"
brew "dive"
brew "doctl"
brew "doppler"
brew "grype"
brew "infisical/get-cli/infisical"
brew "kubectl"
brew "kubectx"
brew "opentofu"
brew "syft"
brew "trivy"

# Desktop apps
cask "chatgpt"
cask "docker-desktop"
cask "google-chrome"
cask "microsoft-teams"
cask "slack"
cask "visual-studio-code"

# App store apps
mas "Numbers", id: 409203825
mas "Pages", id: 409201541

# VScode extensions
vscode "ms-azuretools.vscode-containers"        # Container Tools
vscode "golang.go"                              # Go
vscode "ms-python.python"                       # Python
vscode "amazonwebservices.aws-toolkit-vscode"   # AWS Toolkit
vscode "opentofu.vscode-opentofu"               # OpenTofu
vscode "openai.chatgpt"                         # OpenAI Codex
vscode "ms-vscode.live-server"                  # Live Server
vscode "tomoki1207.pdf"                         # vscode-pdf
vscode "esbenp.prettier-vscode"                 # Prettier
vscode "dbaeumer.vscode-eslint"                 # ESLint
vscode "catppuccin.catppuccin-vsc"              # Catppuccin Theme
vscode "catppuccin.catppuccin-vsc-icons"        # Catppuccin Icons
vscode "tamasfe.even-better-toml"               # TOML
vscode "bradlc.vscode-tailwindcss"              # Tailwind
vscode "github.vscode-pull-request-github"      # GitHub PRs
vscode "github.vscode-github-actions"           # Github Actions
