# Install Binaries
brew "coreutils"
brew "diffutils"
brew "findutils"
brew "gnu-sed"
brew "grep"
brew "gzip"
brew "wget"
brew "make"
brew "git"
brew "hub"
brew "mas"
brew "jq"
brew "go"
brew "doctl"
brew "awscli"

# Install Apps
cask "1password-cli"
cask "dropbox"
cask "google-chrome"
cask "atom"
cask "whatsapp"
cask "vlc"
cask "docker"

# Install App Store Apps
mas "1Password 7 - Password Manager", id: 1333542190
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Slack", id: 803453959
